In [1]:
import pandas as pd
import numpy as np

In [2]:
# two main data structures in pandas, the Series & the DataFrame
# series = 1 dimensional array-like structure with values of same type + associated array of data labels called its index

obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
# get array object of the Series
obj.array

<NumpyExtensionArray>
[np.int64(4), np.int64(7), np.int64(-5), np.int64(3)]
Length: 4, dtype: int64

In [6]:
# get index object of the Series
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
# can create a Series with a labeled index

obj2 = pd.Series([4, 7, -3, 5], index = ['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -3
c    5
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [12]:
# you can use labels for indexing

obj2[['a', 'b']]

a   -3
b    7
dtype: int64

In [13]:
# can perform similar operations as with NumPy arrays

obj2[obj2 > 0]

d    4
b    7
c    5
dtype: int64

In [14]:
obj2 * 2

d     8
b    14
a    -6
c    10
dtype: int64

In [16]:
'b' in obj2

True

In [19]:
# convert dictionary to a Series

sdata = {
    'Ohio': 35_000,
    'Texas': 71_000,
    'Oregon': 16_000,
    'Utah': 5_000
}

obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [20]:
# convert back to dictionary

obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [24]:
# manually assign index to Series

obj4 = pd.Series(obj3, index = ['California', 'Oregon', 'Utah', 'Texas'])

California        NaN
Oregon        16000.0
Utah           5000.0
Texas         71000.0
dtype: float64

In [25]:
# use pd.isna() or pd.notna() to detect missing values

obj4.isna()

California     True
Oregon        False
Utah          False
Texas         False
dtype: bool

In [26]:
obj4.notna()

California    False
Oregon         True
Utah           True
Texas          True
dtype: bool

In [27]:
# Series automatically align data by index

obj3 + obj4

California         NaN
Ohio               NaN
Oregon         32000.0
Texas         142000.0
Utah           10000.0
dtype: float64

In [28]:
obj4

California        NaN
Oregon        16000.0
Utah           5000.0
Texas         71000.0
dtype: float64

In [30]:
# Series and its index have a name attribute

obj4.name = 'population'
obj4

California        NaN
Oregon        16000.0
Utah           5000.0
Texas         71000.0
Name: population, dtype: float64

In [31]:
obj4.index.name = 'state'
obj4

state
California        NaN
Oregon        16000.0
Utah           5000.0
Texas         71000.0
Name: population, dtype: float64

In [36]:
# Series index can be altered in place by assignment

obj.index = ['Bob', 'Carl', 'Dog', 'Meg']
obj

Bob     4
Carl    7
Dog    -5
Meg     3
dtype: int64

In [37]:
# construct a DataFrame from a dictionary of equal-length lists or arrays

data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [38]:
# .head() method selects the first 5 rows in the DataFrame

frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [39]:
# .tail() method returns last 5 rows

frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [40]:
# if you specify the columns when creating the Data Frame, then the fields will be arranged in that order

pd.DataFrame(data, columns = ['year', 'pop', 'state'])

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [42]:
# passing a non-existent column will assign missing values to it

pd.DataFrame(data, columns = ['year', 'pop', 'state', 'example'])

   year  pop   state example
0  2000  1.5    Ohio     NaN
1  2001  1.7    Ohio     NaN
2  2002  3.6    Ohio     NaN
3  2001  2.4  Nevada     NaN
4  2002  2.9  Nevada     NaN
5  2003  3.2  Nevada     NaN

In [43]:
# a column in a DataFrame can be retrieved as a Series

frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [44]:
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [49]:
# can select rows with the iloc and loc attributes
# loc = label based indexing
# iloc = integer based indexing

frame.iloc[2:4]

    state  year  pop
2    Ohio  2002  3.6
3  Nevada  2001  2.4

In [50]:
frame.loc[2:4]

    state  year  pop
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [52]:
frame2 = pd.DataFrame(data, columns = ['year', 'pop', 'state', 'debt'])
frame2.debt = 16.5
frame2

   year  pop   state  debt
0  2000  1.5    Ohio  16.5
1  2001  1.7    Ohio  16.5
2  2002  3.6    Ohio  16.5
3  2001  2.4  Nevada  16.5
4  2002  2.9  Nevada  16.5
5  2003  3.2  Nevada  16.5

In [54]:
frame2['debt'] = np.arange(6.)
frame2

   year  pop   state  debt
0  2000  1.5    Ohio   0.0
1  2001  1.7    Ohio   1.0
2  2002  3.6    Ohio   2.0
3  2001  2.4  Nevada   3.0
4  2002  2.9  Nevada   4.0
5  2003  3.2  Nevada   5.0

In [56]:
# series being added to a DataFrame are added based on the index & missing indexes are assigned null values

val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])

frame2.debt = val
frame2

   year  pop   state  debt
0  2000  1.5    Ohio   NaN
1  2001  1.7    Ohio   NaN
2  2002  3.6    Ohio  -1.2
3  2001  2.4  Nevada   NaN
4  2002  2.9  Nevada  -1.5
5  2003  3.2  Nevada  -1.7

In [59]:
# assigning a column that doesn't exist will create a new column

frame2['capital'] = ['Colombus', 'Colombus', 'Colombus', 'Carson City', 'Carson City', 'Carson City']
frame2

   year  pop   state  debt      capital
0  2000  1.5    Ohio   NaN     Colombus
1  2001  1.7    Ohio   NaN     Colombus
2  2002  3.6    Ohio  -1.2     Colombus
3  2001  2.4  Nevada   NaN  Carson City
4  2002  2.9  Nevada  -1.5  Carson City
5  2003  3.2  Nevada  -1.7  Carson City

In [61]:
# del keyword can delete columns

del frame2['capital']
frame2

   year  pop   state  debt
0  2000  1.5    Ohio   NaN
1  2001  1.7    Ohio   NaN
2  2002  3.6    Ohio  -1.2
3  2001  2.4  Nevada   NaN
4  2002  2.9  Nevada  -1.5
5  2003  3.2  Nevada  -1.7

In [63]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}

In [67]:
# if nested dictionary is made a DataFrame, pandas interprets outer keys as columns and inner keys as row indices

frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [71]:
# transpose the DataFrame
# transposing back & forth can mess up datatype information

frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [73]:
# dictionaries of series are treated the same way

pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}

pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [76]:
# if DataFrame index and columns have their name attributes set, those will be displayed

frame3.columns.name = 'state'
frame3.index.name = 'year'
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [77]:
# .to_numpy() method returns the data as a 2-dimensional ndarry

frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [78]:
# if the datatypes are different across columns, the data type of the returned array will be chosen to accomodate all data

frame2.to_numpy()

array([[2000, 1.5, 'Ohio', nan],
       [2001, 1.7, 'Ohio', nan],
       [2002, 3.6, 'Ohio', -1.2],
       [2001, 2.4, 'Nevada', nan],
       [2002, 2.9, 'Nevada', -1.5],
       [2003, 3.2, 'Nevada', -1.7]], dtype=object)

In [79]:
frame2

   year  pop   state  debt
0  2000  1.5    Ohio   NaN
1  2001  1.7    Ohio   NaN
2  2002  3.6    Ohio  -1.2
3  2001  2.4  Nevada   NaN
4  2002  2.9  Nevada  -1.5
5  2003  3.2  Nevada  -1.7

In [80]:
obj = pd.Series(np.arange(3), index = ['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [81]:
index[1:]

Index(['b', 'c'], dtype='object')

In [82]:
# index objects are immutable
index[1] = 'd'

TypeError: Index does not support mutable operations

In [83]:
# reindexing creates a new object with values aligned on the new index

obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [85]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [87]:
# for missing values, we can full in the data - important for ordered data like time series data

obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [88]:
# ffill forward-fills the data

obj3.reindex(np.arange(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [93]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index = ['a', 'c', 'd'],
                     columns = ['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [95]:
# for DataFrames, reindex can alter row index, columns, or both 
# when only passed a sequence, it alters the row index

frame2 = frame.reindex(index = ['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [96]:
# columns can be reindexed with the columns keyword

states = ['Texas', 'Utah', 'California']
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [97]:
# another way to reindex

frame.reindex(states, axis = 'columns')

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [101]:
# same thing as above

frame.reindex(states, axis = 1)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [103]:
# reindex with .loc operator

frame.loc[['a', 'd', 'c'], ['California', 'Texas']]

   California  Texas
a           2      1
d           8      7
c           5      4

In [106]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [107]:
frame.loc['a']

Ohio          0
Texas         1
California    2
Name: a, dtype: int64

In [109]:
obj = pd.Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [110]:
# drop columns with the .drop() method

new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [112]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [117]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [122]:
# drop rows with with a sequence of labels

data.drop(index = ['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [123]:
# drop columns with sequence of labels

data.drop(columns = ['two', 'four'])

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [127]:
# drop columns with the axis parameter

data.drop('two', axis = 1)
data.drop('two', axis = 'columns')

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [128]:
data.drop(['Colorado', 'Utah'])

          one  two  three  four
Ohio        0    1      2     3
New York   12   13     14    15

In [129]:
# Series indexing like array indexing except you can use the Serie's index values instead of just integers

obj = pd.Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [130]:
obj['b']

np.float64(1.0)

In [135]:
obj[2]

C:\Users\prattle\AppData\Local\Temp\ipykernel_37756\1027971403.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[2]

np.float64(2.0)

In [134]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [136]:
obj[['a', 'c', 'd']]

a    0.0
c    2.0
d    3.0
dtype: float64

In [138]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [139]:
# preferred indexing method is with .loc operator

obj.loc[['b', 'c', 'a']]

b    1.0
c    2.0
a    0.0
dtype: float64

In [146]:
# use .loc because it's behavior is more consistent than just indexing with []

obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [148]:
# index contains integers, so indexing is based on it

obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [147]:
# index contains strings, so indexing is based on row position or something else

obj2[[0, 1, 2]]

C:\Users\prattle\AppData\Local\Temp\ipykernel_37756\1921031544.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [151]:
# when using .loc, obj.loc[[0, 1, 2]] will fail if the index doesn't have integers

obj2.loc[[0, 1, 2]]

KeyError: "None of [Index([0, 1, 2], dtype='int64')] are in the [index]"

In [152]:
# .loc indexes EXCLUSIVELY with labels, while .iloc indexes EXCLUSIVELY with integers

obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [153]:
obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [163]:
# can slice with labels, but behavior is different (it's inclusive of last value)

obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [164]:
obj1.iloc[0:3]

2    1
0    2
1    3
dtype: int64

In [166]:
# assign values with indexing

obj2.loc['b':'c'] = 5
obj2

a    1
b    5
c    5
dtype: int64

In [168]:
# index into a DataFrame

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [169]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [170]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [172]:
# slice or select data with a boolean array

# first 2 rows
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [173]:
data[data['three'] > 3]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [174]:
# index with a boolean DataFrame

data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [176]:
# assign value of 0 to locations where value = true

data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [177]:
# selection with .loc and .iloc

# select a single row by label
# returns a Series

data.loc['Colorado']

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [178]:
# select multiple rows

data.loc[['Colorado', 'Utah']]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11

In [179]:
# select rows & columns

data.loc['Colorado', ['one', 'three']]

one      0
three    6
Name: Colorado, dtype: int64

In [180]:
# same thing, but using integers with .iloc

data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [181]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [182]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [183]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [184]:
# both indexing functions work with slices too

data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [187]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [188]:
# boolean arrays can be used with .loc but not .iloc

data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [197]:
data.loc[data.three == 0, 'three']

Ohio    0
Name: three, dtype: int64

In [199]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index = ['a', 'c', 'e', 'f', 'g'])

s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [200]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [202]:
# if index pairs aren't the same, the reult is the union of the index pairs
# non-matching indexes will be null

s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [203]:
# DataFrames perform alignment on rows & columns

df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
                   index=["Ohio", "Texas", "Colorado"])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])

df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [204]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [205]:
# adding the DataFrames together returns values only where the indexes of rows & columns matched

df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [212]:
df1 = pd.DataFrame(np.arange(12).reshape((3, 4)),
                   columns = list('abcd'))

df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns = list('abcde'))

df2.loc[1, 'b'] = np.nan

df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [213]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [214]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [215]:
# .add() method can fill null values

df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [218]:
df1.add(df2, fill_value = 123456789)

             a            b            c            d            e
0          0.0          2.0          4.0          6.0  123456793.0
1          9.0  123456794.0         13.0         15.0  123456798.0
2         18.0         20.0         22.0         24.0  123456803.0
3  123456804.0  123456805.0  123456806.0  123456807.0  123456808.0

In [219]:
# DataFrames have various arithmetic methods
# ones with "r" in the beginning are reversed

1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [220]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [221]:
# when reindexing, can specify a different fill value

df1.reindex(columns = df2.columns, fill_value = 0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [222]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [227]:
df1.reindex(np.arange(5), fill_value = 0)

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11
3  0  0   0   0
4  0  0   0   0

In [229]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [230]:
arr[0]

array([0., 1., 2., 3.])

In [232]:
# subtraction is performed once for each row in the ndarray

arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [239]:
# similar behavior with a DataFrame and Series

frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     columns = list('bde'),
                     index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

series = frame.iloc[0]

frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [240]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [242]:
series2 = pd.Series(np.arange(3), index = ['b', 'e', 'f'])

series2

b    0
e    1
f    2
dtype: int64

In [243]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [244]:
series3 = frame['d']
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [245]:
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int64

In [248]:
# use an arithmetic method to broadcast over the columns, matching on the rows
# axis passed is the axis to match on

frame.sub(series3, axis = 'index')

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

In [250]:
# NumPy ufuncs work with pandas objects

frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns = list('bde'),
                     index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -1.505905  1.400027 -0.488110
Ohio   -0.309495  1.062277  0.261101
Texas  -0.277553 -0.091991  0.056905
Oregon  1.308617  1.220446 -0.383328

In [253]:
np.abs(frame)

               b         d         e
Utah    1.505905  1.400027  0.488110
Ohio    0.309495  1.062277  0.261101
Texas   0.277553  0.091991  0.056905
Oregon  1.308617  1.220446  0.383328

In [261]:
# applying a function on one-dimensional arrays to each column or row

def f1(x):
    return x.max() - x.min()

frame.apply(f1) # applied across rows

b    2.814522
d    1.492018
e    0.749211
dtype: float64

In [259]:
f1(frame)

b    2.814522
d    1.492018
e    0.749211
dtype: float64

In [270]:
# apply the function across the columns

frame.apply(f1, axis = 'columns')

Utah      2.905932
Ohio      1.371771
Texas     0.334458
Oregon    1.691946
dtype: float64

In [272]:
# functions passed to the .apply() method can also return Series

def f2(x):
    return pd.Series([x.min(), x.max()], index = ['min', 'max'])

frame.apply(f2)

            b         d         e
min -1.505905 -0.091991 -0.488110
max  1.308617  1.400027  0.261101

In [276]:
# element-wise Python functions be used too with the .map() method

def my_format(x):
    return f'{x:.2f}'

frame.map(my_format)

            b      d      e
Utah    -1.51   1.40  -0.49
Ohio    -0.31   1.06   0.26
Texas   -0.28  -0.09   0.06
Oregon   1.31   1.22  -0.38

In [280]:
# to sort lexicographically by row or column label, use the .sort_index() method
# returns a new sorted object

obj = pd.Series(np.arange(4), index = ['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [281]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [282]:
# can sort DataFrame on either axis

frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index = ['three', 'one'],
                     columns = ['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [283]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [284]:
frame.sort_index(axis = 'columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [285]:
# data is sorted in ascending order by default, but descending is possible

frame.sort_index(axis = 'columns', ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [288]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [289]:
# sort a Series by its values

obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [290]:
# nulls can be sorted to the top first

obj.sort_values(na_position = 'first')

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [291]:
frame = pd.DataFrame({'b': [4, 7, -3, 2],
                      'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [292]:
frame.sort_values('b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [296]:
# sort by multiple columns

frame.sort_values(by = ['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [297]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [298]:
# ranking is done from lowest value to highest
# equal values are assigned the mean rank

obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [299]:
# ranks can be assigned according to order in which they're observed in the data

obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [300]:
# rank in descending order

obj.rank(ascending = False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [301]:
# DataFrame can compute ranks over rows or columns

frame = pd.DataFrame({'b': [4.3, 7, -3, 2],
                      'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [302]:
frame.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [303]:
frame.rank(axis = 'columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [306]:
# multiple tie-breaking methods for ranking are available

frame.rank(method = 'dense')

     b    a    c
0  3.0  1.0  2.0
1  4.0  2.0  3.0
2  1.0  1.0  4.0
3  2.0  2.0  1.0

In [307]:
frame.rank(method = 'min')

     b    a    c
0  3.0  1.0  2.0
1  4.0  3.0  3.0
2  1.0  1.0  4.0
3  2.0  3.0  1.0

In [308]:
# this is basically unique ranking

frame.rank(method = 'first')

     b    a    c
0  3.0  1.0  2.0
1  4.0  3.0  3.0
2  1.0  2.0  4.0
3  2.0  4.0  1.0

In [309]:
# not all pandas functions require unique index values (labels or integers)

obj = pd.Series(np.arange(5), index = ['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [310]:
# .is_unique property of the index can say whether index values are unique or not

obj.index.is_unique

False

In [311]:
# indexing a duplicate label returns all values for that label whereas unique labels return just the 1 value

obj['a']

a    0
a    1
dtype: int64

In [312]:
obj['c']

np.int64(4)

In [316]:
# same logic for a DataFrame

df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index = ['a', 'a', 'b', 'b', 'c'])
df

          0         1         2
a  0.127842  0.202141  0.491986
a  0.364247 -0.205922 -1.270722
b  0.705068 -1.292884 -0.482758
b -1.478897  0.924431  0.104446
c -1.481565  1.557333  0.266107

In [317]:
df.loc['b']

          0         1         2
b  0.705068 -1.292884 -0.482758
b -1.478897  0.924431  0.104446

In [318]:
df.loc['c']

0   -1.481565
1    1.557333
2    0.266107
Name: c, dtype: float64

In [324]:
# easy to compute summary statistics for a DataFrame
# pandas automatically handles missing data

df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [325]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [326]:
# sum across columns instead

df.sum(axis = 'columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [327]:
# When an entire row or column contains all NA values, the sum is 0, whereas if any value is not NA, then the result is NA

df.sum(axis = "index")

one    9.25
two   -5.80
dtype: float64

In [328]:
df.sum(axis = "index", skipna = False)

one   NaN
two   NaN
dtype: float64

In [329]:
df.sum(axis = "columns", skipna = False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [330]:
df.mean(axis = 'columns')

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [331]:
# some methods like .idxmin() or .idxmax() return indirects statistics

# returns index value of where the max value is
df.idxmax()

one    b
two    d
dtype: object

In [332]:
# other methods are accumulations

df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [333]:
# .describe provides many summmary statistics at once

df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [334]:
# for non-numeric data, describe still provides summary statistics

obj = pd.Series(['a', 'a', 'c', 'c'] * 4)
obj

0     a
1     a
2     c
3     c
4     a
5     a
6     c
7     c
8     a
9     a
10    c
11    c
12    a
13    a
14    c
15    c
dtype: object

In [335]:
obj.describe()

count     16
unique     2
top        a
freq       8
dtype: object

In [340]:
price = pd.read_pickle("downloads/yahoo_price.pkl")
volume = pd.read_pickle("downloads/yahoo_volume.pkl")

In [344]:
returns = price.pct_change()

In [347]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [354]:
returns['MSFT'].corr(returns['IBM'])

np.float64(0.49976361144151144)

In [355]:
returns['MSFT'].cov(returns['IBM'])

np.float64(8.870655479703546e-05)

In [356]:
# correlation matrix

returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [357]:
# covariance matrix

returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [359]:
returns.cov().rank(ascending = False)

      AAPL  GOOG  IBM  MSFT
AAPL   1.0   3.0  3.0   3.0
GOOG   2.0   1.0  4.0   2.0
IBM    4.0   4.0  1.0   4.0
MSFT   3.0   2.0  2.0   1.0

In [362]:
# .corrwith() method returns pair-wise correlations

returns.corrwith(returns['IBM'])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [364]:
# data points are aligned by label before correlation is computed

returns.corrwith(returns)

AAPL    1.0
GOOG    1.0
IBM     1.0
MSFT    1.0
dtype: float64

In [365]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [366]:
# array of unique values

obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [381]:
# could sort the returned values with the .sort_values() method

uniques = obj.unique()
uniques.sort()
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [382]:
# .value_counts() returns a series with value counts in descending order

obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [384]:
# isin performs a vectorized set membership check

mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [385]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [388]:
# Index.get_indexer() method - can be used to get the index of each value in an array

to_match = pd.Series(['c', 'c', 'b', 'b', 'c', 'a'])

unique_vals = pd.Series(['c', 'b', 'a'])

indices = pd.Index(unique_vals).get_indexer(to_match)

indices

array([0, 0, 1, 1, 0, 2])

In [389]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3],
                     "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [393]:
# compute value counts for a single column

data['Qu1'].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [395]:
# compute value counts for all columns

result = data.apply(pd.value_counts).fillna(0)
result

C:\Users\prattle\AppData\Local\Temp\ipykernel_37756\597164410.py:3: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [397]:
data.value_counts()

Qu1  Qu2  Qu3
1    2    1      1
3    2    4      1
     3    5      1
4    1    2      1
     3    4      1
Name: count, dtype: int64